### Learning in the GCF Workshop

In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv(r'E:\PortfolioProjects\Python Project\Pandas\gcf_data.csv')

df

   student_id            name  age grade                       email
0           1      John Smith   18     A      john.smith@example.com
1           2   Emily Johnson   17    B+   emily.johnson@example.com
2           3   Michael Brown   19    A-   michael.brown@example.com
3           4     Sarah Davis   18     B     sarah.davis@example.com
4           5    David Wilson   17     A    david.wilson@example.com
5           6    Jennifer Lee   18    B+    jennifer.lee@example.com
6           7   Robert Miller   19     C   robert.miller@example.com
7           8     Lisa Taylor   17    A-     lisa.taylor@example.com
8           9  James Anderson   18     B  james.anderson@example.com
9          10    Megan Thomas   19     A   megan.thomas@example.com

In [5]:
df2 = df

df2.head(5)

   student_id           name  age grade                      email
0           1     John Smith   18     A     john.smith@example.com
1           2  Emily Johnson   17    B+  emily.johnson@example.com
2           3  Michael Brown   19    A-  michael.brown@example.com
3           4    Sarah Davis   18     B    sarah.davis@example.com
4           5   David Wilson   17     A   david.wilson@example.com

In [6]:
print(df.describe)

<bound method NDFrame.describe of    student_id            name  age grade                       email
0           1      John Smith   18     A      john.smith@example.com
1           2   Emily Johnson   17    B+   emily.johnson@example.com
2           3   Michael Brown   19    A-   michael.brown@example.com
3           4     Sarah Davis   18     B     sarah.davis@example.com
4           5    David Wilson   17     A    david.wilson@example.com
5           6    Jennifer Lee   18    B+    jennifer.lee@example.com
6           7   Robert Miller   19     C   robert.miller@example.com
7           8     Lisa Taylor   17    A-     lisa.taylor@example.com
8           9  James Anderson   18     B  james.anderson@example.com
9          10    Megan Thomas   19     A   megan.thomas@example.com >